ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV211/ESP32_WordClockV211.ino
//--------------------------------------------                                                //
// NTP Notify
//--------------------------------------------
void NTPnotify(struct timeval* tv) { ntpJustSynced = true; }                                  // --- NTP time synchronized --- is printed later
//--------------------------------------------                                                //
// NTP Check and Print NTP if synced
//--------------------------------------------
void CheckandPrintNTPsynced(void)
{
 struct tm tm;
 time_t now = time(nullptr);
 localtime_r(&now, &tm); 
 if (Mem.TimeLogPrint != 0 )                                              // Do not print time but do update the display                                                              // do not Print the time string every minute
   { 
    Tekstprintlnf("-- NTP time synchronized --  %02d-%s-%04d %02d:%02d:%02d ",
           timeinfo.tm_mday,  monthNames[timeinfo.tm_mon],   // tm_mon is 0–11
           timeinfo.tm_year + 1900, timeinfo.tm_hour,
           timeinfo.tm_min,          timeinfo.tm_sec);
   }       
 ntpJustSynced = false;
}
//--------------------------------------------                                                //
// NTP Set time zone
//--------------------------------------------
void setTimezone() { setenv("TZ", Mem.Timezone, 1);  tzset(); }
//--------------------------------------------                                                //
// NTP Init NTP
//--------------------------------------------
void initSNTP() 
{  
 sntp_set_time_sync_notification_cb(NTPnotify);                                               // Optional: callback when time syncs
 configTime(0, 0, "pool.ntp.org", "time.nist.gov");                                           // 1 hour sync interval = default
 setTimezone();                                                                               // Must be set after configTime
}
//--------------------------------------------                                                //
// NTP Get a NTP time and wait max 2.5 sec 
//--------------------------------------------
bool wait4SNTP() 
{
 int32_t Tick = millis(); 
 bool SNTPtimeValid = true;
 while (sntp_get_sync_status() != SNTP_SYNC_STATUS_COMPLETED) 
  { if ((millis() - Tick) >2500) {SNTPtimeValid = false; break;}   }                          // Wait max 2.5 seconds 
return  SNTPtimeValid;
}

//--------------------------------------------                                                //
// WIFI Check for a Pending command received from the web page 
// Log SWversion to web page when Log = true
//--------------------------------------------
void BuildHTMLPage(bool Log)
{
 int i = 0;
 html_info[0] = 0;
 DoNotLog = !Log;
 SWversion();
 DoNotLog = false;
 
 size_t topLen    = strlen(index_html_top);
 size_t infoLen   = strlen(html_info);
 size_t footerLen = strlen(index_html_footer);
 size_t totalLen  = topLen + infoLen + footerLen;
 
 if (totalLen >= MAXSIZE_HTML_PAGE)
   {
    snprintf(HTML_page, MAXSIZE_HTML_PAGE,
             "%s<br>Send I for menu\n*** INCREASE MAXSIZE_HTML_PAGE (need %u) ***<br>",
             index_html_top, (unsigned)totalLen);
    return;
   }
 
 memcpy(HTML_page + i, index_html_top,    topLen);     i += topLen;
 memcpy(HTML_page + i, html_info,         infoLen);    i += infoLen;
 memcpy(HTML_page + i, index_html_footer, footerLen);  i += footerLen;
 HTML_page[i] = 0;
}
// void BuildHTMLPage(bool Log)                                                                   // Build HTML_page from current state. log=true: menu also goes to log (use for i/ii)
// {
//  int i = 0, n;
//  html_info[0] = 0;
//  DoNotLog = !Log;                                                                              // Suppress log output unless explicitly requested (i/ii)
//  SWversion();
//  DoNotLog = false;
//  for (n=0;n<strlen(index_html_top);n++)       HTML_page[i++] = (char) index_html_top[n];
//  if (i <= MAXSIZE_HTML_PAGE - 999)
//   {
//    for (n=0;n<strlen(html_info);n++)          HTML_page[i++] = (char) html_info[n];
//    for (n=0;n<strlen(index_html_footer);n++)  HTML_page[i++] = (char) index_html_footer[n];
//   }
//  else strcat(HTML_page, "<br> Send I for menu\n*** INCREASE MAXSIZE_HTML_PAGE in Webpage.h ***<br><br><br>");
//  HTML_page[i] = 0;
// }
//--------------------------------------------                                                //
// WIFI CheckWIFIcommand
//--------------------------------------------
void CheckWIFIcommand(void)
{
 if (PendingCommand.length() > 0)
  {
   ReworkInputString(PendingCommand);
   BuildHTMLPage(false);                                                                      // Rebuild page after command; no logging (only i/ii should log the menu) 
  }
}
//--------------------------------------------                                                //
// WIFI WEBPAGE
//--------------------------------------------
void WebPage(void)
{
 BuildHTMLPage(true);                                                                         // Build initial page at startup with logging enabled
 server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)                                  // Send web page with input fields to client
   {  request->send(200, "text/html",(const char*) HTML_page  );  }    ); 
 server.on("/log", HTTP_GET, [](AsyncWebServerRequest *request)                               // Serve the log viewer HTML page
   {  request->send(200, "text/html", logData);    });                                        // Serve the HTML page from LogViewer.h
 server.on("/tekstprint",  HTTP_GET, HandleTekstPrint);                                       // LOGBUFFER Printlast 500 lines
 server.on("/tekstdownload", HTTP_GET, HandleTekstDownload);                                  // LOGBUFFER Stream all the circular log buffer directly to the client
 server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request)
   {
    String inputMessage;
    if (request->hasParam(PARAM_INPUT_1)) {inputMessage = request->getParam(PARAM_INPUT_1)->value();}
    PendingCommand = inputMessage;                                                            //  Command → queue it and redirect
    request->redirect("/wait");
});
